app/views/forums/index.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."forum_id" = ?  [["forum_id", 1]]
---
          <h4><%= link_to h(forum.name), forum_path(forum.id) %></h4>
          <small><%= forum.questions.count %> questions</small><br />