app/views/forums/show.html.erb

      <td><%= link_to h(question.title), question_path(question.id) %>
      <td><%= !question.answers.nil? ? question.answers.length : 0 %></td>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]