app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(@answer.question_id)
    respond_to do |format|
      if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("content", "created_at", "updated_at", "question_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "xczcxczxczxczxxzcvfbdfdfbvccbxcvxcv"], ["created_at", "2019-11-06 17:28:41.473017"], ["updated_at", "2019-11-06 17:28:41.473017"], ["question_id", 2], ["user_id", 1]]