app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", "asdasdasd"], ["commentable_id", 1], ["commentable_type", "Question"], ["created_at", "2019-11-07 04:31:42.583454"], ["updated_at", "2019-11-07 04:31:42.583454"], ["user_id", 1]]
---
    def create
      @comment = @commentable.comments.new comment_params

      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_commentable
      puts "Inside find_commentable : question id = #{params[:question_id]}"
      @commentable = Comment.find_by_id(params[:comment_id]) if params[:comment_id]
      @commentable = Question.find_by_id(params[:question_id]) if params[:question_id]