app/controllers/forums_controller.rb

  def index
    @forums = Forum.all
---
SELECT "forums".* FROM "forums"

  def create
    @forum = Forum.new(forum_params)

    respond_to do |format|
      if @forum.save
---
INSERT INTO "forums" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Another Forum"], ["description", "Trying to create a new Forum"], ["created_at", "2019-11-06 13:49:09.603903"], ["updated_at", "2019-11-06 13:49:09.603903"]]

  def update
    respond_to do |format|
      if @forum.update(forum_params)
---
UPDATE "forums" SET "description" = ?, "updated_at" = ? WHERE "forums"."id" = ?  [["description", "Questions and answers related to Ruby on Rails"], ["updated_at", "2019-11-06 13:11:29.009847"], ["id", 1]]

    def set_forum
      @forum = Forum.find(params[:id])
---
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]