app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "body", "user_id", "created_at", "updated_at", "forum_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasdasd"], ["body", "asdacxzczxczxcvzxczxczx"], ["user_id", 1], ["created_at", "2019-11-06 14:35:21.922116"], ["updated_at", "2019-11-06 14:35:21.922116"], ["forum_id", 1]]